IlleniumDillon/MM32LLD/MM32/Sfr/MM32_TIMReg.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2022-10-31 10:33:40
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2022-11-02 21:08:34
 * @FilePath: \CODE\MM32\Sfr\MM32_TIMReg.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#ifndef _MM32_TIMREG_H_
#define _MM32_TIMREG_H_

#include "MM32_RegBase.h"

#include "MM32_TIMRegDef.h"

/*#define MOUDLE_TIM2		((MM32_TIM*)TIM2_BASE)

#define MOUDLE_TIM3		((MM32_TIM*)TIM3_BASE)

#define MOUDLE_TIM4		((MM32_TIM*)TIM4_BASE)

#define MOUDLE_TIM5		((MM32_TIM*)TIM5_BASE)

#define MOUDLE_TIM6		((MM32_TIM*)TIM6_BASE)

#define MOUDLE_TIM7		((MM32_TIM*)TIM7_BASE)

#define MOUDLE_TIM1		((MM32_TIM*)TIM1_BASE)

#define MOUDLE_TIM8		((MM32_TIM*)TIM8_BASE)*/

/*#define TIM2_CR1		((MM32_TIM_CR1*)(TIM2_BASE+0X00))

#define TIM2_CR2		((MM32_TIM_CR2*)(TIM2_BASE+0X04))

#define TIM2_SMCR		((MM32_TIM_SMCR*)(TIM2_BASE+0X08))

#define TIM2_DIER		((MM32_TIM_DIER*)(TIM2_BASE+0X0C))

#define TIM2_SR		((MM32_TIM_SR*)(TIM2_BASE+0X10))

#define TIM2_EGR		((MM32_TIM_EGR*)(TIM2_BASE+0X14))

#define TIM2_CCMR1		((MM32_TIM_CCMR1*)(TIM2_BASE+0X18))

#define TIM2_CCMR2		((MM32_TIM_CCMR2*)(TIM2_BASE+0X1C))

#define TIM2_CCER		((MM32_TIM_CCER*)(TIM2_BASE+0X20))

#define TIM2_CNT		((MM32_TIM_CNT*)(TIM2_BASE+0X24))

#define TIM2_PSC		((MM32_TIM_PSC*)(TIM2_BASE+0X28))

#define TIM2_ARR		((MM32_TIM_ARR*)(TIM2_BASE+0X2C))

#define TIM2_RCR		((MM32_TIM_RCR*)(TIM2_BASE+0X30))

#define TIM2_CCR1		((MM32_TIM_CCR1*)(TIM2_BASE+0X34))

#define TIM2_CCR2		((MM32_TIM_CCR2*)(TIM2_BASE+0X38))

#define TIM2_CCR3		((MM32_TIM_CCR3*)(TIM2_BASE+0X3C))

#define TIM2_CCR4		((MM32_TIM_CCR4*)(TIM2_BASE+0X40))

#define TIM2_BDTR		((MM32_TIM_BDTR*)(TIM2_BASE+0X44))

#define TIM2_DCR		((MM32_TIM_DCR*)(TIM2_BASE+0X48))

#define TIM2_DMAR		((MM32_TIM_DMAR*)(TIM2_BASE+0X4C))

#define TIM2_OR		((MM32_TIM_OR*)(TIM2_BASE+0X50))

#define TIM2_CCMR3		((MM32_TIM_CCMR3*)(TIM2_BASE+0X54))

#define TIM2_CCR5		((MM32_TIM_CCR5*)(TIM2_BASE+0X58))

#define TIM2_PDER		((MM32_TIM_PDER*)(TIM2_BASE+0X5C))

#define TIM2_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM2_BASE+0X60))

#define TIM2_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM2_BASE+0X64))

#define TIM2_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM2_BASE+0X68))

#define TIM2_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM2_BASE+0X6C))

#define TIM2_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM2_BASE+0X70))

#define TIM3_CR1		((MM32_TIM_CR1*)(TIM3_BASE+0X00))

#define TIM3_CR2		((MM32_TIM_CR2*)(TIM3_BASE+0X04))

#define TIM3_SMCR		((MM32_TIM_SMCR*)(TIM3_BASE+0X08))

#define TIM3_DIER		((MM32_TIM_DIER*)(TIM3_BASE+0X0C))

#define TIM3_SR		((MM32_TIM_SR*)(TIM3_BASE+0X10))

#define TIM3_EGR		((MM32_TIM_EGR*)(TIM3_BASE+0X14))

#define TIM3_CCMR1		((MM32_TIM_CCMR1*)(TIM3_BASE+0X18))

#define TIM3_CCMR2		((MM32_TIM_CCMR2*)(TIM3_BASE+0X1C))

#define TIM3_CCER		((MM32_TIM_CCER*)(TIM3_BASE+0X20))

#define TIM3_CNT		((MM32_TIM_CNT*)(TIM3_BASE+0X24))

#define TIM3_PSC		((MM32_TIM_PSC*)(TIM3_BASE+0X28))

#define TIM3_ARR		((MM32_TIM_ARR*)(TIM3_BASE+0X2C))

#define TIM3_RCR		((MM32_TIM_RCR*)(TIM3_BASE+0X30))

#define TIM3_CCR1		((MM32_TIM_CCR1*)(TIM3_BASE+0X34))

#define TIM3_CCR2		((MM32_TIM_CCR2*)(TIM3_BASE+0X38))

#define TIM3_CCR3		((MM32_TIM_CCR3*)(TIM3_BASE+0X3C))

#define TIM3_CCR4		((MM32_TIM_CCR4*)(TIM3_BASE+0X40))

#define TIM3_BDTR		((MM32_TIM_BDTR*)(TIM3_BASE+0X44))

#define TIM3_DCR		((MM32_TIM_DCR*)(TIM3_BASE+0X48))

#define TIM3_DMAR		((MM32_TIM_DMAR*)(TIM3_BASE+0X4C))

#define TIM3_OR		((MM32_TIM_OR*)(TIM3_BASE+0X50))

#define TIM3_CCMR3		((MM32_TIM_CCMR3*)(TIM3_BASE+0X54))

#define TIM3_CCR5		((MM32_TIM_CCR5*)(TIM3_BASE+0X58))

#define TIM3_PDER		((MM32_TIM_PDER*)(TIM3_BASE+0X5C))

#define TIM3_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM3_BASE+0X60))

#define TIM3_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM3_BASE+0X64))

#define TIM3_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM3_BASE+0X68))

#define TIM3_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM3_BASE+0X6C))

#define TIM3_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM3_BASE+0X70))

#define TIM4_CR1		((MM32_TIM_CR1*)(TIM4_BASE+0X00))

#define TIM4_CR2		((MM32_TIM_CR2*)(TIM4_BASE+0X04))

#define TIM4_SMCR		((MM32_TIM_SMCR*)(TIM4_BASE+0X08))

#define TIM4_DIER		((MM32_TIM_DIER*)(TIM4_BASE+0X0C))

#define TIM4_SR		((MM32_TIM_SR*)(TIM4_BASE+0X10))

#define TIM4_EGR		((MM32_TIM_EGR*)(TIM4_BASE+0X14))

#define TIM4_CCMR1		((MM32_TIM_CCMR1*)(TIM4_BASE+0X18))

#define TIM4_CCMR2		((MM32_TIM_CCMR2*)(TIM4_BASE+0X1C))

#define TIM4_CCER		((MM32_TIM_CCER*)(TIM4_BASE+0X20))

#define TIM4_CNT		((MM32_TIM_CNT*)(TIM4_BASE+0X24))

#define TIM4_PSC		((MM32_TIM_PSC*)(TIM4_BASE+0X28))

#define TIM4_ARR		((MM32_TIM_ARR*)(TIM4_BASE+0X2C))

#define TIM4_RCR		((MM32_TIM_RCR*)(TIM4_BASE+0X30))

#define TIM4_CCR1		((MM32_TIM_CCR1*)(TIM4_BASE+0X34))

#define TIM4_CCR2		((MM32_TIM_CCR2*)(TIM4_BASE+0X38))

#define TIM4_CCR3		((MM32_TIM_CCR3*)(TIM4_BASE+0X3C))

#define TIM4_CCR4		((MM32_TIM_CCR4*)(TIM4_BASE+0X40))

#define TIM4_BDTR		((MM32_TIM_BDTR*)(TIM4_BASE+0X44))

#define TIM4_DCR		((MM32_TIM_DCR*)(TIM4_BASE+0X48))

#define TIM4_DMAR		((MM32_TIM_DMAR*)(TIM4_BASE+0X4C))

#define TIM4_OR		((MM32_TIM_OR*)(TIM4_BASE+0X50))

#define TIM4_CCMR3		((MM32_TIM_CCMR3*)(TIM4_BASE+0X54))

#define TIM4_CCR5		((MM32_TIM_CCR5*)(TIM4_BASE+0X58))

#define TIM4_PDER		((MM32_TIM_PDER*)(TIM4_BASE+0X5C))

#define TIM4_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM4_BASE+0X60))

#define TIM4_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM4_BASE+0X64))

#define TIM4_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM4_BASE+0X68))

#define TIM4_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM4_BASE+0X6C))

#define TIM4_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM4_BASE+0X70))

#define TIM5_CR1		((MM32_TIM_CR1*)(TIM5_BASE+0X00))

#define TIM5_CR2		((MM32_TIM_CR2*)(TIM5_BASE+0X04))

#define TIM5_SMCR		((MM32_TIM_SMCR*)(TIM5_BASE+0X08))

#define TIM5_DIER		((MM32_TIM_DIER*)(TIM5_BASE+0X0C))

#define TIM5_SR		((MM32_TIM_SR*)(TIM5_BASE+0X10))

#define TIM5_EGR		((MM32_TIM_EGR*)(TIM5_BASE+0X14))

#define TIM5_CCMR1		((MM32_TIM_CCMR1*)(TIM5_BASE+0X18))

#define TIM5_CCMR2		((MM32_TIM_CCMR2*)(TIM5_BASE+0X1C))

#define TIM5_CCER		((MM32_TIM_CCER*)(TIM5_BASE+0X20))

#define TIM5_CNT		((MM32_TIM_CNT*)(TIM5_BASE+0X24))

#define TIM5_PSC		((MM32_TIM_PSC*)(TIM5_BASE+0X28))

#define TIM5_ARR		((MM32_TIM_ARR*)(TIM5_BASE+0X2C))

#define TIM5_RCR		((MM32_TIM_RCR*)(TIM5_BASE+0X30))

#define TIM5_CCR1		((MM32_TIM_CCR1*)(TIM5_BASE+0X34))

#define TIM5_CCR2		((MM32_TIM_CCR2*)(TIM5_BASE+0X38))

#define TIM5_CCR3		((MM32_TIM_CCR3*)(TIM5_BASE+0X3C))

#define TIM5_CCR4		((MM32_TIM_CCR4*)(TIM5_BASE+0X40))

#define TIM5_BDTR		((MM32_TIM_BDTR*)(TIM5_BASE+0X44))

#define TIM5_DCR		((MM32_TIM_DCR*)(TIM5_BASE+0X48))

#define TIM5_DMAR		((MM32_TIM_DMAR*)(TIM5_BASE+0X4C))

#define TIM5_OR		((MM32_TIM_OR*)(TIM5_BASE+0X50))

#define TIM5_CCMR3		((MM32_TIM_CCMR3*)(TIM5_BASE+0X54))

#define TIM5_CCR5		((MM32_TIM_CCR5*)(TIM5_BASE+0X58))

#define TIM5_PDER		((MM32_TIM_PDER*)(TIM5_BASE+0X5C))

#define TIM5_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM5_BASE+0X60))

#define TIM5_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM5_BASE+0X64))

#define TIM5_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM5_BASE+0X68))

#define TIM5_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM5_BASE+0X6C))

#define TIM5_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM5_BASE+0X70))

#define TIM6_CR1		((MM32_TIM_CR1*)(TIM6_BASE+0X00))

#define TIM6_CR2		((MM32_TIM_CR2*)(TIM6_BASE+0X04))

#define TIM6_SMCR		((MM32_TIM_SMCR*)(TIM6_BASE+0X08))

#define TIM6_DIER		((MM32_TIM_DIER*)(TIM6_BASE+0X0C))

#define TIM6_SR		((MM32_TIM_SR*)(TIM6_BASE+0X10))

#define TIM6_EGR		((MM32_TIM_EGR*)(TIM6_BASE+0X14))

#define TIM6_CCMR1		((MM32_TIM_CCMR1*)(TIM6_BASE+0X18))

#define TIM6_CCMR2		((MM32_TIM_CCMR2*)(TIM6_BASE+0X1C))

#define TIM6_CCER		((MM32_TIM_CCER*)(TIM6_BASE+0X20))

#define TIM6_CNT		((MM32_TIM_CNT*)(TIM6_BASE+0X24))

#define TIM6_PSC		((MM32_TIM_PSC*)(TIM6_BASE+0X28))

#define TIM6_ARR		((MM32_TIM_ARR*)(TIM6_BASE+0X2C))

#define TIM6_RCR		((MM32_TIM_RCR*)(TIM6_BASE+0X30))

#define TIM6_CCR1		((MM32_TIM_CCR1*)(TIM6_BASE+0X34))

#define TIM6_CCR2		((MM32_TIM_CCR2*)(TIM6_BASE+0X38))

#define TIM6_CCR3		((MM32_TIM_CCR3*)(TIM6_BASE+0X3C))

#define TIM6_CCR4		((MM32_TIM_CCR4*)(TIM6_BASE+0X40))

#define TIM6_BDTR		((MM32_TIM_BDTR*)(TIM6_BASE+0X44))

#define TIM6_DCR		((MM32_TIM_DCR*)(TIM6_BASE+0X48))

#define TIM6_DMAR		((MM32_TIM_DMAR*)(TIM6_BASE+0X4C))

#define TIM6_OR		((MM32_TIM_OR*)(TIM6_BASE+0X50))

#define TIM6_CCMR3		((MM32_TIM_CCMR3*)(TIM6_BASE+0X54))

#define TIM6_CCR5		((MM32_TIM_CCR5*)(TIM6_BASE+0X58))

#define TIM6_PDER		((MM32_TIM_PDER*)(TIM6_BASE+0X5C))

#define TIM6_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM6_BASE+0X60))

#define TIM6_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM6_BASE+0X64))

#define TIM6_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM6_BASE+0X68))

#define TIM6_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM6_BASE+0X6C))

#define TIM6_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM6_BASE+0X70))

#define TIM7_CR1		((MM32_TIM_CR1*)(TIM7_BASE+0X00))

#define TIM7_CR2		((MM32_TIM_CR2*)(TIM7_BASE+0X04))

#define TIM7_SMCR		((MM32_TIM_SMCR*)(TIM7_BASE+0X08))

#define TIM7_DIER		((MM32_TIM_DIER*)(TIM7_BASE+0X0C))

#define TIM7_SR		((MM32_TIM_SR*)(TIM7_BASE+0X10))

#define TIM7_EGR		((MM32_TIM_EGR*)(TIM7_BASE+0X14))

#define TIM7_CCMR1		((MM32_TIM_CCMR1*)(TIM7_BASE+0X18))

#define TIM7_CCMR2		((MM32_TIM_CCMR2*)(TIM7_BASE+0X1C))

#define TIM7_CCER		((MM32_TIM_CCER*)(TIM7_BASE+0X20))

#define TIM7_CNT		((MM32_TIM_CNT*)(TIM7_BASE+0X24))

#define TIM7_PSC		((MM32_TIM_PSC*)(TIM7_BASE+0X28))

#define TIM7_ARR		((MM32_TIM_ARR*)(TIM7_BASE+0X2C))

#define TIM7_RCR		((MM32_TIM_RCR*)(TIM7_BASE+0X30))

#define TIM7_CCR1		((MM32_TIM_CCR1*)(TIM7_BASE+0X34))

#define TIM7_CCR2		((MM32_TIM_CCR2*)(TIM7_BASE+0X38))

#define TIM7_CCR3		((MM32_TIM_CCR3*)(TIM7_BASE+0X3C))

#define TIM7_CCR4		((MM32_TIM_CCR4*)(TIM7_BASE+0X40))

#define TIM7_BDTR		((MM32_TIM_BDTR*)(TIM7_BASE+0X44))

#define TIM7_DCR		((MM32_TIM_DCR*)(TIM7_BASE+0X48))

#define TIM7_DMAR		((MM32_TIM_DMAR*)(TIM7_BASE+0X4C))

#define TIM7_OR		((MM32_TIM_OR*)(TIM7_BASE+0X50))

#define TIM7_CCMR3		((MM32_TIM_CCMR3*)(TIM7_BASE+0X54))

#define TIM7_CCR5		((MM32_TIM_CCR5*)(TIM7_BASE+0X58))

#define TIM7_PDER		((MM32_TIM_PDER*)(TIM7_BASE+0X5C))

#define TIM7_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM7_BASE+0X60))

#define TIM7_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM7_BASE+0X64))

#define TIM7_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM7_BASE+0X68))

#define TIM7_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM7_BASE+0X6C))

#define TIM7_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM7_BASE+0X70))

#define TIM1_CR1		((MM32_TIM_CR1*)(TIM1_BASE+0X00))

#define TIM1_CR2		((MM32_TIM_CR2*)(TIM1_BASE+0X04))

#define TIM1_SMCR		((MM32_TIM_SMCR*)(TIM1_BASE+0X08))

#define TIM1_DIER		((MM32_TIM_DIER*)(TIM1_BASE+0X0C))

#define TIM1_SR		((MM32_TIM_SR*)(TIM1_BASE+0X10))

#define TIM1_EGR		((MM32_TIM_EGR*)(TIM1_BASE+0X14))

#define TIM1_CCMR1		((MM32_TIM_CCMR1*)(TIM1_BASE+0X18))

#define TIM1_CCMR2		((MM32_TIM_CCMR2*)(TIM1_BASE+0X1C))

#define TIM1_CCER		((MM32_TIM_CCER*)(TIM1_BASE+0X20))

#define TIM1_CNT		((MM32_TIM_CNT*)(TIM1_BASE+0X24))

#define TIM1_PSC		((MM32_TIM_PSC*)(TIM1_BASE+0X28))

#define TIM1_ARR		((MM32_TIM_ARR*)(TIM1_BASE+0X2C))

#define TIM1_RCR		((MM32_TIM_RCR*)(TIM1_BASE+0X30))

#define TIM1_CCR1		((MM32_TIM_CCR1*)(TIM1_BASE+0X34))

#define TIM1_CCR2		((MM32_TIM_CCR2*)(TIM1_BASE+0X38))

#define TIM1_CCR3		((MM32_TIM_CCR3*)(TIM1_BASE+0X3C))

#define TIM1_CCR4		((MM32_TIM_CCR4*)(TIM1_BASE+0X40))

#define TIM1_BDTR		((MM32_TIM_BDTR*)(TIM1_BASE+0X44))

#define TIM1_DCR		((MM32_TIM_DCR*)(TIM1_BASE+0X48))

#define TIM1_DMAR		((MM32_TIM_DMAR*)(TIM1_BASE+0X4C))

#define TIM1_OR		((MM32_TIM_OR*)(TIM1_BASE+0X50))

#define TIM1_CCMR3		((MM32_TIM_CCMR3*)(TIM1_BASE+0X54))

#define TIM1_CCR5		((MM32_TIM_CCR5*)(TIM1_BASE+0X58))

#define TIM1_PDER		((MM32_TIM_PDER*)(TIM1_BASE+0X5C))

#define TIM1_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM1_BASE+0X60))

#define TIM1_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM1_BASE+0X64))

#define TIM1_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM1_BASE+0X68))

#define TIM1_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM1_BASE+0X6C))

#define TIM1_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM1_BASE+0X70))

#define TIM8_CR1		((MM32_TIM_CR1*)(TIM8_BASE+0X00))

#define TIM8_CR2		((MM32_TIM_CR2*)(TIM8_BASE+0X04))

#define TIM8_SMCR		((MM32_TIM_SMCR*)(TIM8_BASE+0X08))

#define TIM8_DIER		((MM32_TIM_DIER*)(TIM8_BASE+0X0C))

#define TIM8_SR		((MM32_TIM_SR*)(TIM8_BASE+0X10))

#define TIM8_EGR		((MM32_TIM_EGR*)(TIM8_BASE+0X14))

#define TIM8_CCMR1		((MM32_TIM_CCMR1*)(TIM8_BASE+0X18))

#define TIM8_CCMR2		((MM32_TIM_CCMR2*)(TIM8_BASE+0X1C))

#define TIM8_CCER		((MM32_TIM_CCER*)(TIM8_BASE+0X20))

#define TIM8_CNT		((MM32_TIM_CNT*)(TIM8_BASE+0X24))

#define TIM8_PSC		((MM32_TIM_PSC*)(TIM8_BASE+0X28))

#define TIM8_ARR		((MM32_TIM_ARR*)(TIM8_BASE+0X2C))

#define TIM8_RCR		((MM32_TIM_RCR*)(TIM8_BASE+0X30))

#define TIM8_CCR1		((MM32_TIM_CCR1*)(TIM8_BASE+0X34))

#define TIM8_CCR2		((MM32_TIM_CCR2*)(TIM8_BASE+0X38))

#define TIM8_CCR3		((MM32_TIM_CCR3*)(TIM8_BASE+0X3C))

#define TIM8_CCR4		((MM32_TIM_CCR4*)(TIM8_BASE+0X40))

#define TIM8_BDTR		((MM32_TIM_BDTR*)(TIM8_BASE+0X44))

#define TIM8_DCR		((MM32_TIM_DCR*)(TIM8_BASE+0X48))

#define TIM8_DMAR		((MM32_TIM_DMAR*)(TIM8_BASE+0X4C))

#define TIM8_OR		((MM32_TIM_OR*)(TIM8_BASE+0X50))

#define TIM8_CCMR3		((MM32_TIM_CCMR3*)(TIM8_BASE+0X54))

#define TIM8_CCR5		((MM32_TIM_CCR5*)(TIM8_BASE+0X58))

#define TIM8_PDER		((MM32_TIM_PDER*)(TIM8_BASE+0X5C))

#define TIM8_CCR1FALL		((MM32_TIM_CCR1FALL*)(TIM8_BASE+0X60))

#define TIM8_CCR2FALL		((MM32_TIM_CCR2FALL*)(TIM8_BASE+0X64))

#define TIM8_CCR3FALL		((MM32_TIM_CCR3FALL*)(TIM8_BASE+0X68))

#define TIM8_CCR4FALL		((MM32_TIM_CCR4FALL*)(TIM8_BASE+0X6C))

#define TIM8_CCR5FALL		((MM32_TIM_CCR5FALL*)(TIM8_BASE+0X70))
*/
#endif